IDSspa/WLESS_CHG_F28003x/wless_uart/wless_uart.c
#include <stddef.h>
#include <string.h>

#include "driverlib.h"
#include "device.h"
#include "ring_buffer.h"
#include "wless_uart.h"
#include "wless_sm/wless_sm.h"
#include "wless_radio/wless_nrf24.h"
#include "unipd/unipd_control.h"
#include "ttplpfc/ttplpfc.h"
#include "clllc/clllc.h"

#define WLESS_UART_TOKEN_SEP       ';'

const int FIRMWARE_RELEASE = 1025;

#define WLESS_UART_KEY_WH          (1U << 0)
#define WLESS_UART_KEY_VB          (1U << 1)
#define WLESS_UART_KEY_IB          (1U << 2)
#define WLESS_UART_KEY_IC          (1U << 3)
#define WLESS_UART_KEY_SOURCE      (1U << 4)
#define WLESS_UART_KEY_LOAD        (1U << 5)
#define WLESS_UART_KEY_AUTO        (1U << 6)
#define WLESS_UART_KEY_MANUAL      (1U << 7)
#define WLESS_UART_KEY_STOP        (1U << 8)
#define WLESS_UART_KEY_INITOK      (1U << 9)
#define WLESS_UART_KEY_WH_QUERY    (1U << 10)
#define WLESS_UART_KEY_VARS_QUERY  (1U << 11)
#define WLESS_UART_KEY_RADIO_QUERY (1U << 12)
#define WLESS_UART_KEY_RADIO_PING  (1U << 13)
#define WLESS_UART_KEY_UTEST       (1U << 14)
#define WLESS_UART_KEY_UMAP        (1UL << 15)
#define WLESS_UART_KEY_UDMAX       (1UL << 16)
#define WLESS_UART_KEY_UREF        (1UL << 17)
#define WLESS_UART_KEY_UFAULT      (1UL << 18)
#define WLESS_UART_KEY_UHYBRID     (1UL << 19)
#define WLESS_UART_KEY_UENABLE     (1UL << 20)
#define WLESS_UART_KEY_UILTEST     (1UL << 21)
#define WLESS_UART_KEY_UBOOST      (1UL << 22)
#define WLESS_UART_KEY_UQUERY      (1UL << 23)
#define WLESS_UART_KEY_USTEP       (1UL << 24)
#define WLESS_UART_KEY_UIBATMAX    (1UL << 25)
#define WLESS_UART_KEY_UREF_MV     (1UL << 26)
#define WLESS_UART_KEY_UVBAT_MV    (1UL << 27)
#define WLESS_UART_KEY_UVTRIP_MV   (1UL << 28)
#define WLESS_UART_KEY_UITRIP_MA   (1UL << 29)
#define WLESS_UART_KEY_UITRIP_N    (1UL << 30)
#define WLESS_UART_KEY_UVTRIP_V    (1UL << 31)

typedef enum
{
    WLESS_UART_TYPE_VALUE,
    WLESS_UART_TYPE_FLAG,
    WLESS_UART_TYPE_QUERY
} WLESS_UART_EntryType;

typedef struct
{
    const char *key;
    uint8_t keyLen;
    uint16_t *destination;
    uint32_t id;
    WLESS_UART_EntryType type;
} WLESS_UART_ParseEntry;

typedef struct
{
    uint32_t mask;
    uint16_t tokens;
    uint16_t matches;
} WLESS_UART_ParseResult;

typedef struct
{
    uint32_t tickCounter;
    uint32_t stateStepCounter;
    uint16_t localRole;
    uint16_t state;
    uint16_t radioLink;
    uint16_t noAckCount;
    float coilPhysical_Amps;
    float coilOffset_Amps;
    float coilUsed_Amps;
    float remotePowerLimit_Watts;
    float transferredPowerRef_Watts;
    float coilCurrentRef_Amps;
    float coilCurrentErr_Amps;
} WLESS_UART_WptSnapshot;

static WLESS_RingBuffer WLESS_UART_rxBuffer;
static char WLESS_UART_commandBuffer[WLESS_UART_CMD_MAX_LEN];
static uint16_t WLESS_UART_commandIndex;
static uint16_t WLESS_UART_wh;
static uint16_t WLESS_UART_vBus;
static uint16_t WLESS_UART_iBat;
static uint16_t WLESS_UART_iCoil;
static uint16_t WLESS_UART_unipdTest;
static uint16_t WLESS_UART_unipdMap;
static uint16_t WLESS_UART_unipdDutyMaxMilli = 350U;
static uint16_t WLESS_UART_unipdVdcRef;
static uint16_t WLESS_UART_unipdVdcRefConfig = 7U;
static uint16_t WLESS_UART_unipdVdcRefMilli;
static uint32_t WLESS_UART_unipdVdcRefMilliConfig = 7000UL;
static uint16_t WLESS_UART_unipdIBatMaxMilli;
static uint16_t WLESS_UART_unipdIBatMaxMilliConfig = 200U;
static uint16_t WLESS_UART_unipdVBatMilli;
static uint16_t WLESS_UART_unipdVBatMilliConfig = 6000U;
static uint16_t WLESS_UART_unipdVdcTripMilli;
static uint16_t WLESS_UART_unipdILTripMilli;
static uint16_t WLESS_UART_unipdILTripCycles;
static uint16_t WLESS_UART_unipdVdcTripVolts;
static uint16_t WLESS_UART_unipdFaultReset;
static uint16_t WLESS_UART_unipdHybrid;
static uint16_t WLESS_UART_unipdEnable;
static uint16_t WLESS_UART_unipdILTestMilli;
static uint16_t WLESS_UART_unipdOpenLoopBoost;
static uint16_t WLESS_UART_unipdRampStepMicro;
static uint16_t WLESS_UART_unipdHybridActive;

volatile uint32_t WLESS_UART_rxByteCount;
volatile uint32_t WLESS_UART_rxErrorCount;
volatile uint32_t WLESS_UART_rxOverflowCount;
volatile uint32_t WLESS_UART_commandCount;
volatile uint32_t WLESS_UART_commandErrorCount;

static const WLESS_UART_ParseEntry WLESS_UART_parseTable[] =
{
    {"WH?",    3U, NULL,                WLESS_UART_KEY_WH_QUERY, WLESS_UART_TYPE_QUERY},
    {"VARS?",  5U, NULL,                WLESS_UART_KEY_VARS_QUERY, WLESS_UART_TYPE_QUERY},
    {"RADIO?", 6U, NULL,                WLESS_UART_KEY_RADIO_QUERY, WLESS_UART_TYPE_QUERY},
    {"RADIOPING", 9U, NULL,             WLESS_UART_KEY_RADIO_PING,  WLESS_UART_TYPE_FLAG},
    {"UT=",    3U, &WLESS_UART_unipdTest, WLESS_UART_KEY_UTEST,     WLESS_UART_TYPE_VALUE},
    {"UM=",    3U, &WLESS_UART_unipdMap, WLESS_UART_KEY_UMAP,       WLESS_UART_TYPE_VALUE},
    {"UD=",    3U, &WLESS_UART_unipdDutyMaxMilli, WLESS_UART_KEY_UDMAX, WLESS_UART_TYPE_VALUE},
    {"UR=",    3U, &WLESS_UART_unipdVdcRef, WLESS_UART_KEY_UREF,    WLESS_UART_TYPE_VALUE},
    {"UV=",    3U, &WLESS_UART_unipdVdcRefMilli, WLESS_UART_KEY_UREF_MV, WLESS_UART_TYPE_VALUE},
    {"UA=",    3U, &WLESS_UART_unipdIBatMaxMilli, WLESS_UART_KEY_UIBATMAX, WLESS_UART_TYPE_VALUE},
    {"UW=",    3U, &WLESS_UART_unipdVBatMilli, WLESS_UART_KEY_UVBAT_MV, WLESS_UART_TYPE_VALUE},
    {"UX=",    3U, &WLESS_UART_unipdVdcTripMilli, WLESS_UART_KEY_UVTRIP_MV, WLESS_UART_TYPE_VALUE},
    {"UC=",    3U, &WLESS_UART_unipdILTripMilli, WLESS_UART_KEY_UITRIP_MA, WLESS_UART_TYPE_VALUE},
    {"UN=",    3U, &WLESS_UART_unipdILTripCycles, WLESS_UART_KEY_UITRIP_N, WLESS_UART_TYPE_VALUE},
    {"UY=",    3U, &WLESS_UART_unipdVdcTripVolts, WLESS_UART_KEY_UVTRIP_V, WLESS_UART_TYPE_VALUE},
    {"UF=",    3U, &WLESS_UART_unipdFaultReset, WLESS_UART_KEY_UFAULT, WLESS_UART_TYPE_VALUE},
    {"UH=",    3U, &WLESS_UART_unipdHybrid, WLESS_UART_KEY_UHYBRID, WLESS_UART_TYPE_VALUE},
    {"UE=",    3U, &WLESS_UART_unipdEnable, WLESS_UART_KEY_UENABLE, WLESS_UART_TYPE_VALUE},
    {"UI=",    3U, &WLESS_UART_unipdILTestMilli, WLESS_UART_KEY_UILTEST, WLESS_UART_TYPE_VALUE},
    {"UB=",    3U, &WLESS_UART_unipdOpenLoopBoost, WLESS_UART_KEY_UBOOST, WLESS_UART_TYPE_VALUE},
    {"US=",    3U, &WLESS_UART_unipdRampStepMicro, WLESS_UART_KEY_USTEP, WLESS_UART_TYPE_VALUE},
    {"UQ?",    3U, NULL, WLESS_UART_KEY_UQUERY, WLESS_UART_TYPE_QUERY},
    {"WH=",    3U, &WLESS_UART_wh,      WLESS_UART_KEY_WH,       WLESS_UART_TYPE_VALUE},
    {"VB=",    3U, &WLESS_UART_vBus,    WLESS_UART_KEY_VB,       WLESS_UART_TYPE_VALUE},
    {"IB=",    3U, &WLESS_UART_iBat,    WLESS_UART_KEY_IB,       WLESS_UART_TYPE_VALUE},
    {"IC=",    3U, &WLESS_UART_iCoil,   WLESS_UART_KEY_IC,       WLESS_UART_TYPE_VALUE},
    {"SOURCE", 6U, NULL,                WLESS_UART_KEY_SOURCE,   WLESS_UART_TYPE_FLAG},
    {"LOAD",   4U, NULL,                WLESS_UART_KEY_LOAD,     WLESS_UART_TYPE_FLAG},
    {"AUTO",   4U, NULL,                WLESS_UART_KEY_AUTO,     WLESS_UART_TYPE_FLAG},
    {"MANUAL", 6U, NULL,                WLESS_UART_KEY_MANUAL,   WLESS_UART_TYPE_FLAG},
    {"STOP",   4U, NULL,                WLESS_UART_KEY_STOP,     WLESS_UART_TYPE_FLAG},
    {"INITOK", 6U, NULL,                WLESS_UART_KEY_INITOK,   WLESS_UART_TYPE_FLAG}
};

