IDSspa/WLESS_CHG_F28003x/wless_uart/wless_uart.c
#define WLESS_UART_PARSE_ENTRIES   \
    ((uint16_t)(sizeof(WLESS_UART_parseTable) / \
                sizeof(WLESS_UART_parseTable[0])))

__interrupt void WLESS_UART_rxIsr(void);
static void WLESS_UART_sendVars(void);
static void WLESS_UART_sendRadio(void);
static void WLESS_UART_sendUnipd(void);
static void WLESS_UART_setUnipdTestVector(float vDc);
static void WLESS_UART_applyUnipdDirectionalCurrentLimit(void);
static void WLESS_UART_sendBbcCaptureStatus(void);
static void WLESS_UART_sendBbcCaptureDump(void);
static void WLESS_UART_sendWptIntegration(void);
static void WLESS_UART_sendWptSnapshot(void);
static void WLESS_UART_sendWptCaptureStatus(void);
static void WLESS_UART_sendWptCaptureDump(void);
static uint16_t WLESS_UART_isDigit(char value);

static uint16_t WLESS_UART_parseExactUnsigned(const char *command,
                                               const char *prefix,
                                               uint32_t *value)
{
    const size_t prefixLength = strlen(prefix);
    const char *p;
    uint32_t parsed = 0UL;

    if(strncmp(command, prefix, prefixLength) != 0)
    {
        return 0U;
    }

    p = command + prefixLength;
    if(!WLESS_UART_isDigit(*p))
    {
        return 0U;
    }

    while(WLESS_UART_isDigit(*p))
    {
        const uint32_t digit = (uint32_t)(*p - '0');
        if(parsed > 429496728UL)
        {
            return 0U;
        }
        parsed = (parsed * 10UL) + digit;
        p++;
    }
    if(*p != '\0')
    {
        return 0U;
    }

    *value = parsed;
    return 1U;
}

static void WLESS_UART_applyUnipdDirectionalCurrentLimit(void)
{
    const float currentLimit =
            ((float)WLESS_UART_unipdIBatMaxMilliConfig) * 0.001f;

    if(WLESS_UART_unipdHybridActive == 2U)
    {
        UNIPD_bbcSyntheticInputs.i_bat_rif_max = 0.0f;
        UNIPD_bbcSyntheticInputs.i_bat_rif_min = -currentLimit;
    }
    else
    {
        UNIPD_bbcSyntheticInputs.i_bat_rif_max = currentLimit;
        UNIPD_bbcSyntheticInputs.i_bat_rif_min = 0.0f;
    }
}

static uint16_t WLESS_UART_isDigit(char value)
{
    return (uint16_t)((value >= '0') && (value <= '9'));
}

static uint16_t WLESS_UART_isSpace(char value)
{
    return (uint16_t)((value == ' ') || (value == '\t'));
}

static void WLESS_UART_toUpper(char *str)
{
    while(*str != '\0')
    {
        if((*str >= 'a') && (*str <= 'z'))
        {
            *str = (char)(*str - ('a' - 'A'));
        }
        str++;
    }
}

static int16_t WLESS_UART_parseToken(const char *token, uint16_t length,
                                     uint32_t *mask)
{
    uint16_t i;

    for(i = 0U; i < WLESS_UART_PARSE_ENTRIES; i++)
    {
        const WLESS_UART_ParseEntry *entry = &WLESS_UART_parseTable[i];
        const char *p;
        const char *end;
        uint16_t value = 0U;

        if((length < entry->keyLen) ||
           (strncmp(token, entry->key, entry->keyLen) != 0))
        {
            continue;
        }

        if((entry->type == WLESS_UART_TYPE_FLAG) ||
           (entry->type == WLESS_UART_TYPE_QUERY))
        {
            if(length != entry->keyLen)
            {
                continue;
            }

            *mask |= entry->id;
            return 0;
        }

        p = token + entry->keyLen;
        end = token + length;

        while((p < end) && WLESS_UART_isSpace(*p))
        {
            p++;
        }

        if((p >= end) || !WLESS_UART_isDigit(*p))
        {
            return -2;
        }

        while((p < end) && WLESS_UART_isDigit(*p))
        {
            uint16_t digit = (uint16_t)(*p - '0');

            if((value > 6553U) ||
               ((value == 6553U) && (digit > 5U)))
            {
                return -3;
            }

            value = (uint16_t)(value * 10U + digit);
            p++;
        }

        while(p < end)
        {
            if(!WLESS_UART_isSpace(*p))
            {
                return -4;
            }
            p++;
        }

        *entry->destination = value;
        *mask |= entry->id;
        return 0;
    }

    return -1;
}

static WLESS_UART_ParseResult WLESS_UART_parseAll(const char *str)
{
    WLESS_UART_ParseResult result = {0U, 0U, 0U};
    const char *p = str;

    while(*p != '\0')
    {
        const char *start = p;
        uint32_t oldMask;
        uint16_t length;

        while((*p != '\0') && (*p != WLESS_UART_TOKEN_SEP))
        {
            p++;
        }

        length = (uint16_t)(p - start);
        if(length > 0U)
        {
            result.tokens++;
            oldMask = result.mask;
            (void)WLESS_UART_parseToken(start, length, &result.mask);
            if(result.mask != oldMask)
            {
                result.matches++;
            }
        }

        if(*p == WLESS_UART_TOKEN_SEP)
        {
            p++;
        }
    }

    return result;
}

static uint16_t WLESS_UART_handleCommand(const char *command)
{
    WLESS_UART_ParseResult result;
    uint32_t wptValue;

    WLESS_UART_sendString(command);
    WLESS_UART_sendString("\r\n");

    if(strcmp(command, "CAP=1") == 0)
    {
        WLESS_UART_commandCount++;
        if((UNIPD_bbcVdcTripLatched != 0U) ||
           (UNIPD_bbcILTripLatched != 0U))
        {
            WLESS_UART_sendString("C,FAULT\r\n");
            WLESS_UART_sendBbcCaptureStatus();
            return 0U;
        }
        UNIPD_armBbcCapture();
        WLESS_UART_sendBbcCaptureStatus();
        return 0U;
    }
    if(strcmp(command, "CAP=0") == 0)
    {
        WLESS_UART_commandCount++;
        UNIPD_stopBbcCapture();
        WLESS_UART_sendBbcCaptureStatus();
        return 0U;
    }
    if(strcmp(command, "CAP?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendBbcCaptureStatus();
        return 0U;
    }
    if(strcmp(command, "CAPD?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendBbcCaptureDump();
        return 0U;
    }

    /* Keep the read-only release query outside the already full 32-bit
     * command mask.  Exact matching also ensures that FW=... is rejected. */
    if(strcmp(command, "FW?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendString("FW=");
        WLESS_UART_sendInt((int32_t)FIRMWARE_RELEASE);
        WLESS_UART_sendString("\r\n");
        return 0U;
    }

