IDSspa/WLESS_CHG_F28003x/wless_uart/wless_uart.c
    /*
     * Correct the physical IL_A/IL_B sign convention without consuming a bit
     * in the already full command mask.  Changing polarity while the BBC is
     * active would instantaneously change controller feedback, so reject it.
     * UP bit 0 = invert IL_A; bit 1 = invert IL_B.
     */
    if(strcmp(command, "UP?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendString("UP=");
        WLESS_UART_sendInt((int32_t)UNIPD_bbcCurrentPolarityMask);
        WLESS_UART_sendString("\r\n");
        return 0U;
    }
    if(WLESS_UART_parseExactUnsigned(command, "UP=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 3UL)
        {
            WLESS_UART_sendString("UP RANGE\r\n");
            WLESS_UART_commandErrorCount++;
            return 1U;
        }
        if((UNIPD_bbcPowerOutputEnable != 0U) ||
           (TTPLPFC_bbcEnabled != 0U) ||
           (TTPLPFC_bbcDockTestEnable != 0U))
        {
            WLESS_UART_sendString("UP REJECTED ACTIVE\r\n");
            WLESS_UART_commandErrorCount++;
            return 1U;
        }
        UNIPD_bbcCurrentPolarityMask = (unsigned int)wptValue;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendString("UP=");
        WLESS_UART_sendInt((int32_t)UNIPD_bbcCurrentPolarityMask);
        WLESS_UART_sendString("\r\n");
        return 0U;
    }

    /* Explicit HFC source bridge control for bench tests.  The receiver test
     * path remains disabled: the remote bridge is used as a passive rectifier. */
    if(strcmp(command, "HFC=0") == 0)
    {
        WLESS_UART_commandCount++;
        CLLLC_clearTrip = 0;
        CLLLC_hfcReceiverTestRun = 0U;
        CLLLC_hfcReceiverTestEnable = 0U;
        CLLLC_FORCE_PWM_OST_TRIP(CLLLC_PRIM_LEG1_PWM_BASE);
        CLLLC_FORCE_PWM_OST_TRIP(CLLLC_PRIM_LEG2_PWM_BASE);
#if (CLLLC_PWM3_SYNC90_ENABLED == 1) && (CLLLC_SECONDARY_ENABLED == 0)
        CLLLC_FORCE_PWM_OST_TRIP(CLLLC_SEC_LEG1_PWM_BASE);
#endif
        WLESS_UART_sendString("HFC=0\r\n");
        return 0U;
    }

    if(strcmp(command, "HFC=1") == 0)
    {
        WLESS_UART_commandCount++;
        CLLLC_hfcReceiverTestRun = 0U;
        CLLLC_hfcReceiverTestEnable = 0U;
        CLLLC_clearTrip = 1;
        WLESS_UART_sendString("HFC=1\r\n");
        return 0U;
    }

    if(strcmp(command, "HFC?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendString("H,");
        WLESS_UART_sendInt((int32_t)CLLLC_tripFlag.CLLLC_TripFlag_Enum);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)CLLLC_hfcGanFaultActiveLow);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)CLLLC_pwmFrequency_Hz);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(CLLLC_pwmDutyPrimRef_pu * 1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(CLLLC_pwmPhaseShiftPrimLegsRef_pu *
                                    1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)CLLLC_iTankModSensedRaw);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(CLLLC_iTankModSensed_pu *
                                     CLLLC_IPRIM_TANK_MAX_SENSE_AMPS *
                                     1000.0f));
        WLESS_UART_sendString(",S,F=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcActuatorFault);
        WLESS_UART_sendString(",LAST_mpu=");
        WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcPhaseLast_pu * 1000.0f));
        WLESS_UART_sendString(",PEAK_mpu=");
        WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcPhasePeak_pu * 1000.0f));
        WLESS_UART_sendString(",TICKS=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcPhaseTicksLast);
        WLESS_UART_sendString(",CYC=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcActiveCycles);
        WLESS_UART_sendString(",FVD_mV=");
        WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcFaultVdc_Volts * 1000.0f));
        WLESS_UART_sendString(",PHS1=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcEpwm1TbphsRawLast);
        WLESS_UART_sendString(",PHS2=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcEpwm2TbphsRawLast);
        WLESS_UART_sendString(",PRD1=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcEpwm1TbprdLast);
        WLESS_UART_sendString(",PRD2=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcEpwm2TbprdLast);
        WLESS_UART_sendString(",CTL1=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcEpwm1TbctlLast);
        WLESS_UART_sendString(",CTL2=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcEpwm2TbctlLast);
        WLESS_UART_sendString(",MAN=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcManualPhaseEnable);
        WLESS_UART_sendString(",MPH_mpu=");
        WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcManualPhase_pu * 1000.0f));
        WLESS_UART_sendString(",RRINV=");
        WLESS_UART_sendInt((int32_t)UNIPD_wptHfcRemoteRoleInvalidCycles);
        WLESS_UART_sendString("\r\n");
        return 0U;
    }

    if(strcmp(command, "WPTISRC=OFF") == 0)
    {
        WLESS_UART_commandCount++;
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptSourceCoilSyntheticEnable = 0U;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(strcmp(command, "WPTILOAD=OFF") == 0)
    {
        WLESS_UART_commandCount++;
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptLoadCoilSyntheticEnable = 0U;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(strcmp(command, "SMTHR?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendString("SMTHR VBUS_MIN_V=");
        WLESS_UART_sendInt((int32_t)WLESS_SM_vBusMin_V);
        WLESS_UART_sendString(",IBAT_MIN_mA=");
        WLESS_UART_sendInt((int32_t)WLESS_SM_iBatMin_mA);
        WLESS_UART_sendString(",ICOIL_MIN_mA=");
        WLESS_UART_sendInt((int32_t)WLESS_SM_iCoilMin_mA);
        WLESS_UART_sendString("\r\n");
        return 0U;
    }

