IDSspa/WLESS_CHG_F28003x/wless_uart/wless_uart.c
    if(WLESS_UART_parseExactUnsigned(command, "SMVBUS=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 65535UL)
        {
            WLESS_UART_sendString("SMVBUS RANGE\r\n");
            return 1U;
        }
        WLESS_SM_vBusMin_V = (uint16_t)wptValue;
        WLESS_UART_sendString("SMVBUS OK\r\n");
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "SMIBAT=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 65535UL)
        {
            WLESS_UART_sendString("SMIBAT RANGE\r\n");
            return 1U;
        }
        WLESS_SM_iBatMin_mA = (uint16_t)wptValue;
        WLESS_UART_sendString("SMIBAT OK\r\n");
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "SMICOIL=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 65535UL)
        {
            WLESS_UART_sendString("SMICOIL RANGE\r\n");
            return 1U;
        }
        WLESS_SM_iCoilMin_mA = (uint16_t)wptValue;
        WLESS_UART_sendString("SMICOIL OK\r\n");
        return 0U;
    }

    if(strcmp(command, "WPTHFC=0") == 0)
    {
        WLESS_UART_commandCount++;
        UNIPD_disableWptHfcActuator();
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(strcmp(command, "WPTHFCPHAUTO") == 0)
    {
        WLESS_UART_commandCount++;
        UNIPD_disableWptHfcActuator();
        UNIPD_wptHfcManualPhaseEnable = 0U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "WPTHFCPH=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        UNIPD_disableWptHfcActuator();
        if(wptValue > 500UL)
        {
            WLESS_UART_sendString("ERR RANGE\r\n");
            return 0U;
        }
        UNIPD_wptHfcManualPhase_pu = (float)wptValue * 0.001f;
        UNIPD_wptHfcManualPhaseEnable = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(strcmp(command, "WPTHFC=1") == 0)
    {
        WLESS_UART_commandCount++;
        if((UNIPD_wptIntegrationEnable == 0U) ||
           (WLESS_SM_localRole != WLESS_SM_ROLE_SOURCE) ||
           (WLESS_SM_remoteRole != WLESS_SM_ROLE_LOAD) ||
           (WLESS_SM_radioLink != WLESS_SM_LINK_OK) ||
           (UNIPD_wptSourceCoilSyntheticEnable == 0U))
        {
            WLESS_UART_sendString("WPTHFC INHIBIT\r\n");
            WLESS_UART_sendWptIntegration();
            return 1U;
        }
        UNIPD_wptHfcActuatorFault = 0U;
        UNIPD_wptHfcPhaseRequested_pu = 0.0f;
        UNIPD_wptHfcPhaseApplied_pu = 0.0f;
        UNIPD_wptHfcPhasePeak_pu = 0.0f;
        UNIPD_wptHfcPhaseLast_pu = 0.0f;
        UNIPD_wptHfcPhaseTicksLast = 0;
        UNIPD_wptHfcActiveCycles = 0UL;
        UNIPD_wptHfcRemoteRoleInvalidCycles = 0UL;
        UNIPD_wptHfcFaultVdc_Volts = 0.0f;
        CLLLC_hfcReceiverTestDuty_pu = 0.5f;
        CLLLC_hfcReceiverTestPhaseShiftPrimLegs_pu = 0.5f;
        CLLLC_pwmPhaseShiftPrimLegsRef_pu = 0.5f;
        CLLLC_pwmPhaseShiftPrimLegs_pu = 0.5f;
        CLLLC_hfcReceiverTestMode =
                CLLLC_HFC_RECEIVER_TEST_MODE_FIXED_SAFE_PWM;
        CLLLC_hfcReceiverTestSyncEnable = 0U;
        CLLLC_hfcReceiverTestEnable = 1U;
        CLLLC_hfcReceiverTestRun = 1U;
        CLLLC_clearTrip = 1;
        UNIPD_wptHfcActuatorEnable = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "WPTHFCLIM=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        UNIPD_disableWptHfcActuator();
        if((wptValue < 1UL) || (wptValue > 500UL))
        {
            WLESS_UART_sendString("WPTHFCLIM RANGE\r\n");
            return 1U;
        }
        UNIPD_wptHfcPhaseMax_pu = (float)wptValue * 0.001f;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "WPTHFCRAMP=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        UNIPD_disableWptHfcActuator();
        if((wptValue < 1UL) || (wptValue > 100UL))
        {
            WLESS_UART_sendString("WPTHFCRAMP RANGE\r\n");
            return 1U;
        }
        UNIPD_wptHfcPhaseRampStep_pu = (float)wptValue * 0.000001f;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "WPTISRC=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 100000UL)
        {
            WLESS_UART_sendString("WPTISRC RANGE\r\n");
            return 1U;
        }
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptSourceCoilSynthetic_Amps = (float)wptValue * 0.001f;
        UNIPD_wptSourceCoilSyntheticEnable = 1U;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "WPTILOAD=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 100000UL)
        {
            WLESS_UART_sendString("WPTILOAD RANGE\r\n");
            return 1U;
        }
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptLoadCoilSynthetic_Amps = (float)wptValue * 0.001f;
        UNIPD_wptLoadCoilSyntheticEnable = 1U;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "WPTPLIMINIT=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 10000UL)
        {
            WLESS_UART_sendString("WPTPLIMINIT RANGE\r\n");
            return 1U;
        }
        UNIPD_disableWptHfcActuator();
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptTxPowerSeed_Watts = (float)wptValue;
        UNIPD_wptTxPowerSeedPending = 1U;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "WPTPLOADINIT=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 10000UL)
        {
            WLESS_UART_sendString("WPTPLOADINIT RANGE\r\n");
            return 1U;
        }
        UNIPD_disableWptHfcActuator();
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptLoadPowerSeed_Watts = (float)wptValue;
        UNIPD_wptLoadPowerSeedPending = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "WPTIZERO=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 100000UL)
        {
            WLESS_UART_sendString("WPTIZERO RANGE\r\n");
            return 1U;
        }
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptLoadCoilOffset_Amps = (float)wptValue * 0.001f;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    /* UniPD distributed WPT computation only. This enable never writes PWM. */
    if(strcmp(command, "WPT=0") == 0)
    {
        WLESS_UART_commandCount++;
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }
    if(strcmp(command, "WPT=1") == 0)
    {
        WLESS_UART_commandCount++;
        UNIPD_resetControlStatesCommand = 1U;
        UNIPD_wptIntegrationEnable = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }
    if(strcmp(command, "WPT?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }
    if(strcmp(command, "WPTSNAP?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendWptSnapshot();
        return 0U;
    }

    if(strcmp(command, "WPTCAP=1") == 0)
    {
        WLESS_UART_commandCount++;
        UNIPD_armWptCapture();
        WLESS_UART_sendWptCaptureStatus();
        return 0U;
    }

