IDSspa/WLESS_CHG_F28003x/wless_uart/wless_uart.c
    if(strcmp(command, "WPTCAP=0") == 0)
    {
        WLESS_UART_commandCount++;
        UNIPD_stopWptCapture();
        WLESS_UART_sendWptCaptureStatus();
        return 0U;
    }

    if(strcmp(command, "WPTCAP?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendWptCaptureStatus();
        return 0U;
    }

    if(strcmp(command, "WPTCAPD?") == 0)
    {
        WLESS_UART_commandCount++;
        WLESS_UART_sendWptCaptureDump();
        return 0U;
    }

    if(WLESS_UART_parseExactUnsigned(command, "WPTCAPDEC=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if((wptValue == 0UL) || (wptValue > 65535UL) ||
           (UNIPD_wptCaptureArmed != 0U))
        {
            WLESS_UART_sendString("WPTCAPDEC REJECTED\r\n");
            return 0U;
        }
        UNIPD_wptCaptureDecimation = (unsigned int)wptValue;
        WLESS_UART_sendWptCaptureStatus();
        return 0U;
    }
    if(WLESS_UART_parseExactUnsigned(command, "WPTSRC=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if((wptValue < 1000UL) || (wptValue > 300000UL))
        {
            WLESS_UART_sendString("WPTSRC RANGE\r\n");
            return 1U;
        }
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptVdcSourceRef_Volts = (float)wptValue * 0.001f;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }
    if(WLESS_UART_parseExactUnsigned(command, "WPTLOAD=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if((wptValue < 1000UL) || (wptValue > 300000UL))
        {
            WLESS_UART_sendString("WPTLOAD RANGE\r\n");
            return 1U;
        }
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptVdcLoadRef_Volts = (float)wptValue * 0.001f;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }
    if(WLESS_UART_parseExactUnsigned(command, "WPTIMAX=", &wptValue) != 0U)
    {
        WLESS_UART_commandCount++;
        if(wptValue > 100000UL)
        {
            WLESS_UART_sendString("WPTIMAX RANGE\r\n");
            return 1U;
        }
        UNIPD_wptIntegrationEnable = 0U;
        UNIPD_wptCoilCurrentMax_Amps = (float)wptValue * 0.001f;
        UNIPD_resetControlStatesCommand = 1U;
        WLESS_UART_sendWptIntegration();
        return 0U;
    }

    result = WLESS_UART_parseAll(command);
    if(result.tokens == 0U)
    {
        return 0U;
    }
    if(result.matches == 0U)
    {
        WLESS_UART_sendString("Wrong command\r\n");
        WLESS_UART_commandErrorCount++;
        return 1U;
    }

    WLESS_UART_commandCount++;

    if((result.mask & WLESS_UART_KEY_WH) != 0U)
    {
        WLESS_SM_localEnergyEncoded = WLESS_SM_encodeCapacityWh(WLESS_UART_wh);
    }
    if((result.mask & WLESS_UART_KEY_WH_QUERY) != 0U)
    {
        WLESS_UART_sendString("WH=");
        WLESS_UART_sendInt(WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded));
        WLESS_UART_sendString("\r\n");
    }
    if((result.mask & WLESS_UART_KEY_VARS_QUERY) != 0U)
    {
        WLESS_UART_sendVars();
    }
    if((result.mask & WLESS_UART_KEY_RADIO_QUERY) != 0U)
    {
        WLESS_UART_sendRadio();
    }
    if((result.mask & WLESS_UART_KEY_RADIO_PING) != 0U)
    {
        WLESS_UART_sendString(WLESS_NRF24_sendDiagnosticPing() ?
                              "RADIOPING OK\r\n" : "RADIOPING REJECTED\r\n");
    }
    if((result.mask & WLESS_UART_KEY_UTEST) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        if((WLESS_UART_unipdTest > 0U) &&
           (WLESS_UART_unipdTest <= 20U))
        {
            WLESS_UART_setUnipdTestVector((float)WLESS_UART_unipdTest);
        }
        else if(WLESS_UART_unipdTest == 0U)
        {
            UNIPD_bbcSyntheticTestEnable = 0U;
            UNIPD_resetControlStatesCommand = 1U;
        }
        WLESS_UART_sendUnipd();
    }
    if((result.mask & WLESS_UART_KEY_UQUERY) != 0U)
    {
        WLESS_UART_sendUnipd();
    }
    if((result.mask & WLESS_UART_KEY_UMAP) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        UNIPD_bbcDutyMappingMode = (WLESS_UART_unipdMap != 0U) ? 1U : 0U;
        UNIPD_resetControlStatesCommand = 1U;
    }
    if((result.mask & WLESS_UART_KEY_UDMAX) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        if(WLESS_UART_unipdDutyMaxMilli > 950U)
        {
            WLESS_UART_unipdDutyMaxMilli = 950U;
        }
        UNIPD_bbcPowerOutputDutyMax_pu =
                ((float)WLESS_UART_unipdDutyMaxMilli) * 0.001f;
    }
    if((result.mask & WLESS_UART_KEY_USTEP) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((WLESS_UART_unipdRampStepMicro >= 1U) &&
           (WLESS_UART_unipdRampStepMicro <= 2000U))
        {
            UNIPD_bbcPowerOutputDutyRampStep_pu =
                    ((float)WLESS_UART_unipdRampStepMicro) * 0.000001f;
        }
    }
    if((result.mask & WLESS_UART_KEY_UREF) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((WLESS_UART_unipdVdcRef > 0U) &&
           (WLESS_UART_unipdVdcRef <= 300U))
        {
            WLESS_UART_unipdVdcRefConfig = WLESS_UART_unipdVdcRef;
            WLESS_UART_unipdVdcRefMilliConfig =
                    ((uint32_t)WLESS_UART_unipdVdcRef) * 1000UL;
            UNIPD_bbcSyntheticInputs.v_dc_pbat_rif =
                    ((float)WLESS_UART_unipdVdcRefMilliConfig) * 0.001f;
            UNIPD_resetControlStatesCommand = 1U;
        }
    }
    if((result.mask & WLESS_UART_KEY_UREF_MV) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((WLESS_UART_unipdVdcRefMilli >= 1000U) &&
           (WLESS_UART_unipdVdcRefMilli <= 60000U))
        {
            WLESS_UART_unipdVdcRefMilliConfig = WLESS_UART_unipdVdcRefMilli;
            WLESS_UART_unipdVdcRefConfig =
                    (WLESS_UART_unipdVdcRefMilliConfig + 500U) / 1000U;
            UNIPD_bbcSyntheticInputs.v_dc_pbat_rif =
                    ((float)WLESS_UART_unipdVdcRefMilliConfig) * 0.001f;
            UNIPD_resetControlStatesCommand = 1U;
        }
    }
    if((result.mask & WLESS_UART_KEY_UIBATMAX) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if(WLESS_UART_unipdIBatMaxMilli <= 20000U)
        {
            WLESS_UART_unipdIBatMaxMilliConfig =
                    WLESS_UART_unipdIBatMaxMilli;
            WLESS_UART_applyUnipdDirectionalCurrentLimit();
            UNIPD_resetControlStatesCommand = 1U;
        }
    }
    if((result.mask & WLESS_UART_KEY_UVBAT_MV) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((WLESS_UART_unipdVBatMilli >= 1000U) &&
           (WLESS_UART_unipdVBatMilli <= 60000U))
        {
            WLESS_UART_unipdVBatMilliConfig = WLESS_UART_unipdVBatMilli;
            UNIPD_bbcSyntheticInputs.v_bat =
                    ((float)WLESS_UART_unipdVBatMilliConfig) * 0.001f;
            UNIPD_resetControlStatesCommand = 1U;
        }
    }
    if((result.mask & WLESS_UART_KEY_UVTRIP_MV) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((WLESS_UART_unipdVdcTripMilli >= 2000U) &&
           (WLESS_UART_unipdVdcTripMilli <= 60000U))
        {
            UNIPD_bbcVdcTripThreshold_Volts =
                    ((float)WLESS_UART_unipdVdcTripMilli) * 0.001f;
            UNIPD_resetControlStatesCommand = 1U;
        }
    }
    if((result.mask & WLESS_UART_KEY_UVTRIP_V) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((WLESS_UART_unipdVdcTripVolts >= 2U) &&
           (WLESS_UART_unipdVdcTripVolts <= 300U))
        {
            UNIPD_bbcVdcTripThreshold_Volts =
                    (float)WLESS_UART_unipdVdcTripVolts;
            UNIPD_bbcVdcTripResetCommand = 1U;
        }
    }
    if((result.mask & WLESS_UART_KEY_UITRIP_MA) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((WLESS_UART_unipdILTripMilli >= 100U) &&
           (WLESS_UART_unipdILTripMilli <= 10000U))
        {
            UNIPD_bbcILTripThreshold_Amps =
                    ((float)WLESS_UART_unipdILTripMilli) * 0.001f;
            UNIPD_bbcVdcTripResetCommand = 1U;
        }
    }
    if((result.mask & WLESS_UART_KEY_UITRIP_N) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((WLESS_UART_unipdILTripCycles >= 1U) &&
           (WLESS_UART_unipdILTripCycles <= 1000U))
        {
            UNIPD_bbcILTripConfirmCycles = WLESS_UART_unipdILTripCycles;
            UNIPD_bbcVdcTripResetCommand = 1U;
        }
    }
    if((result.mask & WLESS_UART_KEY_UFAULT) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if(WLESS_UART_unipdFaultReset == 2U)
        {
            /*
             * Zero-current calibration for the two BBC branch sensors.
             * TTPLPFC_read_individualCurrent() returns
             * 2 * (raw_pu - offset_pu), therefore half of the measured
             * zero-current value is the offset correction.
             */
            TTPLPFC_read_individualCurrent();
            TTPLPFC_iL1_senseOffset_pu += 0.5f * TTPLPFC_iL1_sensed_pu;
            TTPLPFC_iL2_senseOffset_pu += 0.5f * TTPLPFC_iL2_sensed_pu;
            TTPLPFC_read_individualCurrent();
            UNIPD_resetControlStatesCommand = 1U;
            UNIPD_bbcVdcTripResetCommand = 1U;
        }
        else if(WLESS_UART_unipdFaultReset != 0U)
        {
            UNIPD_bbcVdcTripResetCommand = 1U;
        }
    }
    if((result.mask & WLESS_UART_KEY_UILTEST) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((UNIPD_bbcSyntheticTestEnable != 0U) &&
           (UNIPD_bbcSyntheticOverrideMask ==
            UNIPD_BBC_REQUIRED_SIGNAL_MASK) &&
           (WLESS_UART_unipdILTestMilli <= 2000U))
        {
            const float testCurrent =
                    ((float)WLESS_UART_unipdILTestMilli) * 0.001f;
            UNIPD_bbcSyntheticInputs.i_l_a = testCurrent;
            UNIPD_bbcSyntheticInputs.i_l_b = -testCurrent;
        }
    }
    if((result.mask & WLESS_UART_KEY_UBOOST) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        if(WLESS_UART_unipdOpenLoopBoost == 0U)
        {
            TTPLPFC_bbcDockTestEnable = 0;
            TTPLPFC_bbcDockTestLegMode = TTPLPFC_BBC_DOCK_TEST_LEG_DISABLED;
            TTPLPFC_BBC_disable();
        }
        else if((WLESS_UART_unipdOpenLoopBoost == 1U) ||
                (WLESS_UART_unipdOpenLoopBoost == 2U))
        {
            TTPLPFC_BBC_disable();
            TTPLPFC_bbcDockTestEnable = 0;
            TTPLPFC_bbcDockTestMode =
                    (WLESS_UART_unipdOpenLoopBoost == 1U) ?
                    TTPLPFC_BBC_MODE_BOOST : TTPLPFC_BBC_MODE_BUCK;
            TTPLPFC_bbcDockTestLegMode = TTPLPFC_BBC_DOCK_TEST_LEG_BOTH;
            TTPLPFC_bbcDockTestDuty1_pu =
                    UNIPD_bbcPowerOutputDutyMax_pu;
            TTPLPFC_bbcDockTestDuty2_pu =
                    UNIPD_bbcPowerOutputDutyMax_pu;
            TTPLPFC_bbcDockTestDutyRamp1_pu = 0.0f;
            TTPLPFC_bbcDockTestDutyRamp2_pu = 0.0f;
            TTPLPFC_bbcDockTestDutyRampStep_pu =
                    UNIPD_bbcPowerOutputDutyRampStep_pu;
            TTPLPFC_bbcDockTestDutyRampEnable = 1;
            TTPLPFC_bbcDockTestVbusTrip_Volts =
                    UNIPD_bbcVdcTripThreshold_Volts;
            TTPLPFC_bbcDockTestVbusTripLatched = 0;
            TTPLPFC_bbcDockTestVbusTripCapture_Volts = 0.0f;
            TTPLPFC_bbcDockTestVbusMax_Volts = 0.0f;
            TTPLPFC_bbcDockTestEnable = 1;
        }
        else
        {
            TTPLPFC_bbcDockTestEnable = 0;
            TTPLPFC_bbcDockTestLegMode = TTPLPFC_BBC_DOCK_TEST_LEG_DISABLED;
            TTPLPFC_BBC_disable();
        }
    }
    if((result.mask & WLESS_UART_KEY_UHYBRID) != 0U)
    {
        UNIPD_bbcPowerOutputEnable = 0U;
        TTPLPFC_BBC_disable();
        if((WLESS_UART_unipdHybrid == 1U) ||
           (WLESS_UART_unipdHybrid == 2U))
        {
            UNIPD_bbcSyntheticInputs.v_bat =
                    ((float)WLESS_UART_unipdVBatMilliConfig) * 0.001f;
            UNIPD_bbcSyntheticInputs.i_coil_loc = 0.0f;
            UNIPD_bbcSyntheticInputs.i_coil_rem_err = 0.0f;
            UNIPD_bbcSyntheticInputs.i_coil_loc_rif = 0.0f;
            UNIPD_bbcSyntheticInputs.v_dc_pbat_rif =
                    ((float)WLESS_UART_unipdVdcRefMilliConfig) * 0.001f;
            WLESS_UART_unipdHybridActive = WLESS_UART_unipdHybrid;
            WLESS_UART_applyUnipdDirectionalCurrentLimit();
            UNIPD_bbcSyntheticInputs.tx_1_rx_0 =
                    (WLESS_UART_unipdHybridActive == 1U) ? 1U : 0U;
#if TTPLPFC_BBC_COMPLEMENTARY_PWM_ENABLE
            //
            // In synchronous mode UniPD delta always drives the high side;
            // EPWM dead-band hardware produces the low-side complement.
            //
            UNIPD_bbcDutyMappingMode = 0U;
#else
            UNIPD_bbcDutyMappingMode =
                    (WLESS_UART_unipdHybridActive == 1U) ? 1U : 0U;
#endif
            UNIPD_bbcSyntheticValidMask = UNIPD_BBC_REQUIRED_SIGNAL_MASK;
            UNIPD_bbcSyntheticOverrideMask =
                    UNIPD_BBC_REQUIRED_SIGNAL_MASK &
                    ~(UNIPD_BBC_SIGNAL_V_DC |
                      UNIPD_BBC_SIGNAL_V_BAT |
                      UNIPD_BBC_SIGNAL_I_L_A |
                      UNIPD_BBC_SIGNAL_I_L_B);
            UNIPD_bbcSyntheticTestEnable = 1U;
        }
        else
        {
            UNIPD_bbcSyntheticTestEnable = 0U;
            WLESS_UART_unipdHybridActive = 0U;
        }
        UNIPD_resetControlStatesCommand = 1U;
    }
    if((result.mask & WLESS_UART_KEY_UENABLE) != 0U)
    {
        if(WLESS_UART_unipdEnable == 0U)
        {
            UNIPD_bbcPowerOutputEnable = 0U;
            TTPLPFC_BBC_disable();
        }
        else if(((WLESS_UART_unipdHybridActive == 1U) ||
                 (WLESS_UART_unipdHybridActive == 2U)) &&
                 (UNIPD_bbcSyntheticTestEnable != 0U) &&
#if TTPLPFC_BBC_COMPLEMENTARY_PWM_ENABLE
                 (UNIPD_bbcDutyMappingMode == 0U) &&
#else
                 (((WLESS_UART_unipdHybridActive == 1U) &&
                   (UNIPD_bbcDutyMappingMode == 1U)) ||
                  ((WLESS_UART_unipdHybridActive == 2U) &&
                   (UNIPD_bbcDutyMappingMode == 0U))) &&
#endif
                 /*
                  * UD is entered and range-checked as integer milli-pu.
                  * Comparing its float conversion with 0.95f rejected the
                  * nominal boundary UD=950 on the target.
                  */
                 (WLESS_UART_unipdDutyMaxMilli <= 950U) &&
                 (UNIPD_bbcVdcTripEnable != 0U) &&
                 (UNIPD_bbcVdcTripLatched == 0U) &&
                 (UNIPD_bbcILTripEnable != 0U) &&
                 (UNIPD_bbcILTripLatched == 0U) &&
                (UNIPD_bbcInputs.v_dc <
                 UNIPD_bbcVdcTripThreshold_Volts))
        {
            UNIPD_resetControlStatesCommand = 1U;
            UNIPD_bbcRampedDutyA_pu = 0.0f;
            UNIPD_bbcRampedDutyB_pu = 0.0f;
            UNIPD_bbcPowerOutputEnable = 1U;
        }
        else
        {
            WLESS_UART_sendString("UE REJECTED CONFIG\r\n");
        }
    }

#if WLESS_SM_BUILD_VEHICLE == 1
    if((result.mask & WLESS_UART_KEY_SOURCE) != 0U)
    {
        WLESS_SM_localRole = WLESS_SM_ROLE_SOURCE;
    }
    if((result.mask & WLESS_UART_KEY_LOAD) != 0U)
    {
        WLESS_SM_localRole = WLESS_SM_ROLE_LOAD;
    }
    if((result.mask & WLESS_UART_KEY_AUTO) != 0U)
    {
        WLESS_SM_opMode = WLESS_SM_MODE_AUTO;
    }
    if((result.mask & WLESS_UART_KEY_MANUAL) != 0U)
    {
        WLESS_SM_opMode = WLESS_SM_MODE_MANUAL;
    }
    if((result.mask & WLESS_UART_KEY_STOP) != 0U)
    {
        WLESS_SM_stopCommand = 1U;
    }
#endif

    if((result.mask & WLESS_UART_KEY_VB) != 0U)
    {
        WLESS_SM_vBus_V = WLESS_UART_vBus;
    }
    if((result.mask & WLESS_UART_KEY_IB) != 0U)
    {
        WLESS_SM_iBat_mA = WLESS_UART_iBat;
    }
    if((result.mask & WLESS_UART_KEY_IC) != 0U)
    {
        WLESS_SM_iCoil_mA = WLESS_UART_iCoil;
    }
    if((result.mask & WLESS_UART_KEY_INITOK) != 0U)
    {
        WLESS_SM_initOkCommand = 1U;
    }

    WLESS_SM_statusUpdatePending = 1U;
    return 0U;
}

static void WLESS_UART_sendBbcCaptureStatus(void)
{
    WLESS_UART_sendString("C,");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcCaptureArmed);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcCaptureFrozen);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcCaptureCount);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_BBC_CAPTURE_LENGTH);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_BBC_CAPTURE_DECIMATION);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcCaptureTriggerReason);
    WLESS_UART_sendString("\r\n");
}

static void WLESS_UART_sendBbcCaptureDump(void)
{
    UNIPD_BbcCaptureSample sample;
    unsigned int index;

    if(UNIPD_bbcCaptureArmed != 0U)
    {
        WLESS_UART_sendString("C,BUSY\r\n");
        return;
    }

