IDSspa/WLESS_CHG_F28003x/wless_uart/wless_uart.c
    WLESS_UART_sendString("COLUMNS,n,vdc_mV,vbat_mV,ila_mA,ilb_mA,ilrefA_mA,ilrefB_mA,ilerrA_mA,ilerrB_mA,vlrefA_mV,vlrefB_mV,pbat_mW,rawA_u,rawB_u,intA_u,intB_u,mapA_u,mapB_u,appA_u,appB_u,rampA_u,rampB_u\r\n");
    for(index = 0U; index < UNIPD_bbcCaptureCount; index++)
    {
        if(UNIPD_getBbcCaptureSample(index, &sample) == 0U)
        {
            break;
        }
        WLESS_UART_sendString("C,");
        WLESS_UART_sendInt((int32_t)index);
#define WLESS_UART_CAP_FIELD(value, scale) \
        WLESS_UART_sendString(","); \
        WLESS_UART_sendInt((int32_t)((value) * (scale)))
        WLESS_UART_CAP_FIELD(sample.v_dc, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.v_bat, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.i_l_a, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.i_l_b, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.i_l_rif_a, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.i_l_rif_b, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.i_l_err_a, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.i_l_err_b, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.v_l_rif_a, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.v_l_rif_b, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.p_bat_rif, 1000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_raw_a, 1000000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_raw_b, 1000000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_internal_a, 1000000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_internal_b, 1000000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_mapped_a, 1000000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_mapped_b, 1000000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_applied_a, 1000000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_applied_b, 1000000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_ramped_a, 1000000.0f);
        WLESS_UART_CAP_FIELD(sample.duty_ramped_b, 1000000.0f);
#undef WLESS_UART_CAP_FIELD
        WLESS_UART_sendString("\r\n");
    }
    WLESS_UART_sendBbcCaptureStatus();
}

void WLESS_UART_init(void)
{
    WLESS_RB_init(&WLESS_UART_rxBuffer);
    WLESS_UART_commandIndex = 0U;
    WLESS_UART_rxByteCount = 0UL;
    WLESS_UART_rxErrorCount = 0UL;
    WLESS_UART_rxOverflowCount = 0UL;
    WLESS_UART_commandCount = 0UL;
    WLESS_UART_commandErrorCount = 0UL;

    GPIO_setPinConfig(GPIO_28_SCIA_RX);
    GPIO_setPinConfig(GPIO_29_SCIA_TX);
    GPIO_setPadConfig(28U, GPIO_PIN_TYPE_STD | GPIO_PIN_TYPE_PULLUP);
    GPIO_setPadConfig(29U, GPIO_PIN_TYPE_STD | GPIO_PIN_TYPE_PULLUP);
    GPIO_setQualificationMode(28U, GPIO_QUAL_ASYNC);
    GPIO_setQualificationMode(29U, GPIO_QUAL_ASYNC);

    SCI_performSoftwareReset(SCIA_BASE);
    SCI_setConfig(SCIA_BASE, DEVICE_LSPCLK_FREQ, WLESS_UART_BAUDRATE,
                  SCI_CONFIG_WLEN_8 | SCI_CONFIG_STOP_ONE |
                  SCI_CONFIG_PAR_NONE);
    SCI_disableLoopback(SCIA_BASE);
    SCI_resetChannels(SCIA_BASE);
    SCI_resetRxFIFO(SCIA_BASE);
    SCI_resetTxFIFO(SCIA_BASE);
    SCI_clearOverflowStatus(SCIA_BASE);
    SCI_clearInterruptStatus(SCIA_BASE, SCI_INT_RXFF | SCI_INT_RXERR);
    SCI_setFIFOInterruptLevel(SCIA_BASE, SCI_FIFO_TX0, SCI_FIFO_RX1);
    SCI_enableFIFO(SCIA_BASE);
    SCI_enableModule(SCIA_BASE);
    SCI_performSoftwareReset(SCIA_BASE);

    Interrupt_register(INT_SCIA_RX, &WLESS_UART_rxIsr);
    Interrupt_enable(INT_SCIA_RX);
    SCI_enableInterrupt(SCIA_BASE, SCI_INT_RXFF);

    WLESS_SM_statusUpdatePending = 1U;
}

void WLESS_UART_process(void)
{
    uint16_t data;

    while(WLESS_RB_read(&WLESS_UART_rxBuffer, &data))
    {
        char character = (char)data;

        if((character == '\n') || (character == '\r'))
        {
            if(WLESS_UART_commandIndex > 0U)
            {
                WLESS_UART_commandBuffer[WLESS_UART_commandIndex] = '\0';
                WLESS_UART_toUpper(WLESS_UART_commandBuffer);
                (void)WLESS_UART_handleCommand(WLESS_UART_commandBuffer);
                WLESS_UART_commandIndex = 0U;
            }
        }
        else if(WLESS_UART_commandIndex < (WLESS_UART_CMD_MAX_LEN - 1U))
        {
            WLESS_UART_commandBuffer[WLESS_UART_commandIndex++] = character;
        }
        else
        {
            WLESS_UART_commandIndex = 0U;
            WLESS_UART_commandErrorCount++;
        }
    }

    if(WLESS_SM_statusUpdatePending != 0U)
    {
        WLESS_SM_statusUpdatePending = 0U;
        WLESS_UART_sendStatus();
    }
}

void WLESS_UART_sendByte(uint16_t data)
{
    while(SCI_getTxFIFOStatus(SCIA_BASE) == SCI_FIFO_TX16)
    {
    }
    SCI_writeCharNonBlocking(SCIA_BASE, data);
}

void WLESS_UART_sendString(const char *str)
{
    while(*str != '\0')
    {
        WLESS_UART_sendByte((uint16_t)*str);
        str++;
    }
}

void WLESS_UART_sendInt(int32_t value)
{
    char buffer[12];
    uint16_t index = 0U;
    uint32_t magnitude;

    if(value < 0)
    {
        WLESS_UART_sendByte('-');
        magnitude = (uint32_t)(-(value + 1L)) + 1UL;
    }
    else
    {
        magnitude = (uint32_t)value;
    }

    if(magnitude == 0UL)
    {
        WLESS_UART_sendByte('0');
        return;
    }

    while(magnitude != 0UL)
    {
        buffer[index++] = (char)('0' + (magnitude % 10UL));
        magnitude /= 10UL;
    }

    while(index > 0U)
    {
        WLESS_UART_sendByte((uint16_t)buffer[--index]);
    }
}

static const char *WLESS_UART_roleString(WLESS_SM_Role role)
{
    if(role == WLESS_SM_ROLE_SOURCE) return "SOURCE";
    if(role == WLESS_SM_ROLE_LOAD) return "LOAD";
    return "NOTHING";
}

static const char *WLESS_UART_ctrlString(WLESS_SM_ControllerState state)
{
    switch(state)
    {
        case WLESS_SM_CTRL_IDLE: return "IDLE";
        case WLESS_SM_CTRL_INIT: return "INIT";
        case WLESS_SM_CTRL_INITOK: return "INITOK";
        case WLESS_SM_CTRL_WPTON: return "WPTON";
        case WLESS_SM_CTRL_WPTOFF: return "WPTOFF";
        case WLESS_SM_CTRL_WPTEND: return "WPTEND";
        case WLESS_SM_CTRL_WPTERR: return "WPTERR";
        default: return "UNDEFINED";
    }
}

static const char *WLESS_UART_stateString(WLESS_SM_State state)
{
    static const char *const names[] =
    {
        "STANDBY", "DISCOVERY", "INIT_SOURCE", "INIT_LOAD",
        "WAIT_SOURCE", "WAIT_LOAD", "PRECHARGE_SOURCE",
        "PRECHARGE_LOAD", "SOURCE_ON", "LOAD_ON",
        "DISCHARGE_SOURCE", "DISCHARGE_LOAD", "SOURCE_OFF",
        "LOAD_OFF", "SOURCE_END", "LOAD_END", "ENDCHARGE_SOURCE",
        "ENDCHARGE_LOAD"
    };

    if((uint16_t)state < (uint16_t)(sizeof(names) / sizeof(names[0])))
    {
        return names[(uint16_t)state];
    }
    return "UNDEFINED";
}

static void WLESS_UART_sendWptIntegration(void)
{
    WLESS_UART_sendString("WPT EN=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptIntegrationEnable);
    WLESS_UART_sendString(",ROLE=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_localRole);
    WLESS_UART_sendString(",SRCREF_mV=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptVdcSourceRef_Volts * 1000.0f));
    WLESS_UART_sendString(",LOADREF_mV=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptVdcLoadRef_Volts * 1000.0f));
    WLESS_UART_sendString(",IMAX_mA=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptCoilCurrentMax_Amps * 1000.0f));
    WLESS_UART_sendString(",ISYN=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptSourceCoilSyntheticEnable);
    WLESS_UART_sendString(",ILSYN=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptLoadCoilSyntheticEnable);
    WLESS_UART_sendString(",ILSYN_mA=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptLoadCoilSynthetic_Amps * 1000.0f));
    WLESS_UART_sendString(",IPHY_mA=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptLocalCoilPhysical_Amps * 1000.0f));
    WLESS_UART_sendString(",IZERO_mA=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptLoadCoilOffset_Amps * 1000.0f));
    WLESS_UART_sendString(",IUSE_mA=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptLocalCoilUsed_Amps * 1000.0f));
    WLESS_UART_sendString(",PLIM_W=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptTxPowerLimit_Watts);
    WLESS_UART_sendString(",PSEED_W=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptTxPowerSeed_Watts);
    WLESS_UART_sendString(",PSEEDP=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptTxPowerSeedPending);
    WLESS_UART_sendString(",LPSEED_W=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptLoadPowerSeed_Watts);
    WLESS_UART_sendString(",LPSEEDP=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptLoadPowerSeedPending);
    WLESS_UART_sendString(",PREM_W=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptRemotePowerLimit_Watts);
    WLESS_UART_sendString(",PREF_W=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptRxOutput.p_trasf_rif);
    WLESS_UART_sendString(",IREF_cA=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptRxOutput.i_coil_rif * 100.0f));
    WLESS_UART_sendString(",IERR_cA=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptRxOutput.i_coil_err * 100.0f));
    WLESS_UART_sendString(",IREM_cA=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptRemoteCoilErr_Amps * 100.0f));
    WLESS_UART_sendString(",VAC_mV=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcOutput.v_ac_rif * 1000.0f));
    WLESS_UART_sendString(",HENA=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptHfcActuatorEnable);
    WLESS_UART_sendString(",HFLT=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptHfcActuatorFault);
    WLESS_UART_sendString(",HREQ_mpu=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcPhaseRequested_pu * 1000.0f));
    WLESS_UART_sendString(",HAPP_mpu=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcPhaseApplied_pu * 1000.0f));
    WLESS_UART_sendString(",HLIM_mpu=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcPhaseMax_pu * 1000.0f));
    WLESS_UART_sendString(",HRAMP_upc=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcPhaseRampStep_pu * 1000000.0f));
    WLESS_UART_sendString(",PSA_mpu=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcOutput.duty_cycle_ps_a * 1000.0f));
    WLESS_UART_sendString(",PSB_mpu=");
    WLESS_UART_sendInt((int32_t)(UNIPD_wptHfcOutput.duty_cycle_ps_b * 1000.0f));
    WLESS_UART_sendString("\r\n");
}

