IDSspa/WLESS_CHG_F28003x/wless_uart/wless_uart.c
static void WLESS_UART_sendWptSnapshot(void)
{
    WLESS_UART_WptSnapshot snapshot;

    /*
     * Freeze only long enough to copy the ISR-owned values.  Conversion and
     * UART transmission deliberately remain outside the critical section.
     */
    DINT;
    snapshot.tickCounter = WLESS_SM_tickCounter;
    snapshot.stateStepCounter = WLESS_SM_stateStepCounter;
    snapshot.localRole = (uint16_t)WLESS_SM_localRole;
    snapshot.state = (uint16_t)WLESS_SM_state;
    snapshot.radioLink = (uint16_t)WLESS_SM_radioLink;
    snapshot.noAckCount = WLESS_SM_noAckCount;
    snapshot.coilPhysical_Amps = UNIPD_wptLocalCoilPhysical_Amps;
    snapshot.coilOffset_Amps = UNIPD_wptLoadCoilOffset_Amps;
    snapshot.coilUsed_Amps = UNIPD_wptLocalCoilUsed_Amps;
    snapshot.remotePowerLimit_Watts = UNIPD_wptRemotePowerLimit_Watts;
    snapshot.transferredPowerRef_Watts = UNIPD_wptRxOutput.p_trasf_rif;
    snapshot.coilCurrentRef_Amps = UNIPD_wptRxOutput.i_coil_rif;
    snapshot.coilCurrentErr_Amps = UNIPD_wptRxOutput.i_coil_err;
    EINT;

    WLESS_UART_sendString("WPTSNAP TICK=");
    WLESS_UART_sendInt((int32_t)snapshot.tickCounter);
    WLESS_UART_sendString(",STEP=");
    WLESS_UART_sendInt((int32_t)snapshot.stateStepCounter);
    WLESS_UART_sendString(",ROLE=");
    WLESS_UART_sendInt((int32_t)snapshot.localRole);
    WLESS_UART_sendString(",STATE=");
    WLESS_UART_sendInt((int32_t)snapshot.state);
    WLESS_UART_sendString(",LINK=");
    WLESS_UART_sendInt((int32_t)snapshot.radioLink);
    WLESS_UART_sendString(",NOACK=");
    WLESS_UART_sendInt((int32_t)snapshot.noAckCount);
    WLESS_UART_sendString(",IPHY_mA=");
    WLESS_UART_sendInt((int32_t)(snapshot.coilPhysical_Amps * 1000.0f));
    WLESS_UART_sendString(",IZERO_mA=");
    WLESS_UART_sendInt((int32_t)(snapshot.coilOffset_Amps * 1000.0f));
    WLESS_UART_sendString(",IUSE_mA=");
    WLESS_UART_sendInt((int32_t)(snapshot.coilUsed_Amps * 1000.0f));
    WLESS_UART_sendString(",PREM_W=");
    WLESS_UART_sendInt((int32_t)snapshot.remotePowerLimit_Watts);
    WLESS_UART_sendString(",PREF_W=");
    WLESS_UART_sendInt((int32_t)snapshot.transferredPowerRef_Watts);
    WLESS_UART_sendString(",IREF_cA=");
    WLESS_UART_sendInt((int32_t)(snapshot.coilCurrentRef_Amps * 100.0f));
    WLESS_UART_sendString(",IERR_cA=");
    WLESS_UART_sendInt((int32_t)(snapshot.coilCurrentErr_Amps * 100.0f));
    WLESS_UART_sendString("\r\n");
}

static void WLESS_UART_sendWptCaptureStatus(void)
{
    WLESS_UART_sendString("WPTCAP ARM=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptCaptureArmed);
    WLESS_UART_sendString(",FROZEN=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptCaptureFrozen);
    WLESS_UART_sendString(",COUNT=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptCaptureCount);
    WLESS_UART_sendString(",LEN=");
    WLESS_UART_sendInt((int32_t)UNIPD_WPT_CAPTURE_LENGTH);
    WLESS_UART_sendString(",DEC=");
    WLESS_UART_sendInt((int32_t)UNIPD_wptCaptureDecimation);
    WLESS_UART_sendString("\r\n");
}

static void WLESS_UART_sendWptCaptureDump(void)
{
    UNIPD_WptCaptureSample sample;
    unsigned int index;

    if(UNIPD_wptCaptureArmed != 0U)
    {
        WLESS_UART_sendString("WPTCAPD REJECTED ARMED\r\n");
        return;
    }

    WLESS_UART_sendString(
        "WPTCAPD IDX,TICK,ROLE,STATE,LINK,VDC_mV,IPHY_mA,IUSE_mA,"
        "PREF_W,IREF_cA,IERR_cA,VAC_mV,HREQ_mpu,HAPP_mpu,"
        "HAUTO_mpu,HPHY_mpu,MAN,FAULT\r\n");
    for(index = 0U; index < UNIPD_wptCaptureCount; index++)
    {
        if(UNIPD_getWptCaptureSample(index, &sample) == 0U)
        {
            break;
        }
        WLESS_UART_sendString("WPTCAPD ");
        WLESS_UART_sendInt((int32_t)index);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)sample.tick);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)sample.role);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)sample.state);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)sample.link);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.v_dc * 1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.i_coil_physical * 1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.i_coil_used * 1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)sample.p_ref);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.i_ref * 100.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.i_err * 100.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.v_ac_ref * 1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.hfc_request * 1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.hfc_applied * 1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.hfc_auto_hardware * 1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)(sample.hfc_physical * 1000.0f));
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)sample.manual);
        WLESS_UART_sendString(",");
        WLESS_UART_sendInt((int32_t)sample.hfc_fault);
        WLESS_UART_sendString("\r\n");
    }
    WLESS_UART_sendWptCaptureStatus();
}

void WLESS_UART_sendStatus(void)
{
#if WLESS_SM_BUILD_VEHICLE == 1
    WLESS_UART_sendString("VH State=");
#else
    WLESS_UART_sendString("ST State=");
#endif
    WLESS_UART_sendString(WLESS_UART_stateString(WLESS_SM_state));
    WLESS_UART_sendString(", Energy[Wh]=");
    WLESS_UART_sendInt(WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded));
    WLESS_UART_sendString(", Role=");
    WLESS_UART_sendString(WLESS_UART_roleString(WLESS_SM_localRole));
    WLESS_UART_sendString(", WPTState=");
    WLESS_UART_sendString((WLESS_SM_wptState == WLESS_SM_WPT_RUN) ? "RUN" : "STOP");
    WLESS_UART_sendString(", CtrlState=");
    WLESS_UART_sendString(WLESS_UART_ctrlString(WLESS_SM_localCtrlState));
    WLESS_UART_sendString(", Pwr2Ld=");
    WLESS_UART_sendInt(WLESS_SM_powerToLoad);
    WLESS_UART_sendString(", IcoilErr=");
    WLESS_UART_sendInt(WLESS_SM_iCoilErr);
    WLESS_UART_sendString(", AbortState=");
    WLESS_UART_sendString((WLESS_SM_localAbort == WLESS_SM_ABORT_ENABLED) ?
                          "ENABLED" : "DISABLED");
    WLESS_UART_sendString(", RadioLink=");
    WLESS_UART_sendString((WLESS_SM_radioLink == WLESS_SM_LINK_FAIL) ?
                          "FAIL" : "OK");
    WLESS_UART_sendString("\r\n");
}

static void WLESS_UART_sendVars(void)
{
    WLESS_UART_sendString("VARS WH=");
    WLESS_UART_sendInt(WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded));
    WLESS_UART_sendString(", VB=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_vBus_V);
    WLESS_UART_sendString(", IB=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_iBat_mA);
    WLESS_UART_sendString(", IC=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_iCoil_mA);
    WLESS_UART_sendString(", VBMIN=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_vBusMin_V);
    WLESS_UART_sendString(", IBMIN=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_iBatMin_mA);
    WLESS_UART_sendString(", ICMIN=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_iCoilMin_mA);
    WLESS_UART_sendString(", MODE=");
    WLESS_UART_sendString((WLESS_SM_opMode == WLESS_SM_MODE_MANUAL) ?
                          "MANUAL" : "AUTO");
    WLESS_UART_sendString(", STOP=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_stopCommand);
    WLESS_UART_sendString(", INITOK=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_initOkCommand);
    WLESS_UART_sendString("\r\n");
}

