IDSspa/WLESS_CHG_F28003x/wless_uart/wless_uart.c
static void WLESS_UART_sendRadio(void)
{
#if WLESS_NRF24_ENABLE == 1
    // Read live values so repeated RADIO? commands also exercise the SPI link.
    WLESS_NRF24_lastStatus = WLESS_NRF24_readRegister(0x07U);
    WLESS_NRF24_lastConfig = WLESS_NRF24_readRegister(0x00U);
    WLESS_NRF24_lastFifoStatus = WLESS_NRF24_readRegister(0x17U);
#endif
    WLESS_UART_sendString("RADIO EN=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_ENABLE);
    WLESS_UART_sendString(", INIT=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_initOk);
    WLESS_UART_sendString(", INITERR=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_initFailMask);
    WLESS_UART_sendString(", STATUS=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_lastStatus);
    WLESS_UART_sendString(", CONFIG=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_lastConfig);
    WLESS_UART_sendString(", FIFO=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_lastFifoStatus);
    WLESS_UART_sendString(", IRQ=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_irqCount);
    WLESS_UART_sendString(", TX=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_txCount);
    WLESS_UART_sendString(", RX=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_rxCount);
    WLESS_UART_sendString(", ACK=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_ackCount);
    WLESS_UART_sendString(", MAXRT=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_maxRtCount);
    WLESS_UART_sendString(", TXSEQ=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_lastTxSequence);
    WLESS_UART_sendString(", RXSEQ=");
    WLESS_UART_sendInt((int32_t)WLESS_NRF24_lastRxSequence);
    WLESS_UART_sendString(", NOACK=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_noAckCount);
    WLESS_UART_sendString(", REMOTE_E=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_remoteEnergyEncoded);
    WLESS_UART_sendString(", REMOTE_ROLE=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_remoteRole);
    WLESS_UART_sendString(", REMOTE_CTRL=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_remoteCtrlState);
    WLESS_UART_sendString(", REMOTE_ABORT=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_remoteAbort);
    WLESS_UART_sendString(", S=");
    WLESS_UART_sendInt((int32_t)WLESS_SM_stateStepCounter);
    WLESS_UART_sendString("\r\n");
}

static void WLESS_UART_setUnipdTestVector(float vDc)
{
    UNIPD_bbcPowerOutputEnable = 0U;
    UNIPD_bbcSyntheticInputs.v_dc = vDc;
    UNIPD_bbcSyntheticInputs.v_bat = 6.0f;
    UNIPD_bbcSyntheticInputs.i_l_a = 0.0f;
    UNIPD_bbcSyntheticInputs.i_l_b = 0.0f;
    UNIPD_bbcSyntheticInputs.i_coil_loc = 0.0f;
    UNIPD_bbcSyntheticInputs.i_coil_rem_err = 0.0f;
    UNIPD_bbcSyntheticInputs.i_coil_loc_rif = 0.0f;
    UNIPD_bbcSyntheticInputs.v_dc_pbat_rif = 10.0f;
    UNIPD_bbcSyntheticInputs.i_bat_rif_max = 2.0f;
    UNIPD_bbcSyntheticInputs.i_bat_rif_min = 0.0f;
    UNIPD_bbcSyntheticInputs.tx_1_rx_0 = 1U;
    UNIPD_bbcSyntheticValidMask = UNIPD_BBC_REQUIRED_SIGNAL_MASK;
    UNIPD_bbcSyntheticOverrideMask = UNIPD_BBC_REQUIRED_SIGNAL_MASK;
    UNIPD_bbcSyntheticTestEnable = 1U;
    UNIPD_resetControlStatesCommand = 1U;
}

static void WLESS_UART_sendUnipd(void)
{
    WLESS_UART_sendString("U,");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcSyntheticTestEnable);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcSignalValidMask);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcSignalMissingMask);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcInputs.v_dc * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcInputs.v_bat * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)TTPLPFC_vBatAdcRaw);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(TTPLPFC_vBatSensed_Volts * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcOutput.p_bat_rif * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcOutput.i_l_rif_a * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcInputs.i_l_a * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcInputs.i_l_b * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcInputs.i_coil_loc * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcOutput.duty_cycle_pwm_a * 1000000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcMappedDutyA_pu * 1000000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcAppliedDutyA_pu * 1000000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcOutput.abilita_pwm);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcPowerOutputEnable);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)TTPLPFC_bbcEnabled);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)TTPLPFC_bbcDockTestEnable);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcDutyMappingMode);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcPowerOutputDutyMax_pu * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcInputs.v_dc_pbat_rif * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcVdcTripLatched);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcVdcTripThreshold_Volts * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcILTripThreshold_Amps * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcILTripConfirmCycles);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcVdcTripCapture_Volts * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcILTripLatched);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcILTripThreshold_Amps * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcILTripCaptureA_Amps * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcILTripCaptureB_Amps * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_vdcControllerGainScale * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcRampedDutyA_pu * 1000000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcPowerOutputDutyRampStep_pu *
                                 1000000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)WLESS_UART_unipdVdcRefConfig);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)WLESS_UART_unipdIBatMaxMilliConfig);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)WLESS_UART_unipdVdcRefMilliConfig);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)WLESS_UART_unipdVBatMilliConfig);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcVdcTripThreshold_Volts * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)WLESS_UART_unipdHybridActive);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcSyntheticInputs.i_bat_rif_min *
                                 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcSyntheticInputs.i_bat_rif_max *
                                 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcOutput.duty_cycle_pwm_b *
                                 1000000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcMappedDutyB_pu * 1000000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcAppliedDutyB_pu * 1000000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcRampedDutyB_pu * 1000000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcDebugILerrA * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcDebugILerrB * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)UNIPD_bbcCurrentPolarityMask);
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcILRawA_Amps * 1000.0f));
    WLESS_UART_sendString(",");
    WLESS_UART_sendInt((int32_t)(UNIPD_bbcILRawB_Amps * 1000.0f));
    WLESS_UART_sendString("\r\n");
}

__interrupt void WLESS_UART_rxIsr(void)
{
    uint32_t status = SCI_getRxStatus(SCIA_BASE);

    if((status & SCI_RXSTATUS_ERROR) != 0UL)
    {
        WLESS_UART_rxErrorCount++;
        SCI_clearOverflowStatus(SCIA_BASE);
        SCI_clearInterruptStatus(SCIA_BASE, SCI_INT_RXERR);
    }

    while(SCI_getRxFIFOStatus(SCIA_BASE) != SCI_FIFO_RX0)
    {
        uint16_t data = SCI_readCharNonBlocking(SCIA_BASE);
        WLESS_UART_rxByteCount++;
        if(!WLESS_RB_write(&WLESS_UART_rxBuffer, data))
        {
            WLESS_UART_rxOverflowCount++;
        }
    }

    SCI_clearInterruptStatus(SCIA_BASE, SCI_INT_RXFF);
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP9);
}
